org/jpacheco.xyz.org
#+title: jpachecoxyz.github.io
#+author: Javier Pacheco
#+description: My website wrapped in an org file.
#+hugo_base_dir: ../
#+startup: content
#+hugo_custom_front_matter: toc true
#+hugo_auto_set_lastmod: nil
#+date: 2024-07-04
#+tags: blog(b) emacs(e) linux(l) personal(p) script(s) tecnology(t) wayland(w) work(W)
#+seq_todo: TODO(t) WAIT(w@/!) | DONE(d!)

* Wiki                                                        :wiki:personal:
CLOSED: [2024-09-03 Tue 15:40]
:PROPERTIES:
:EXPORT_FILE_NAME: content/wiki.md
:EXPORT_DESCRIPTION: My personal wiki for some topics.
:DATE: [2024-09-03 Tue]
:EXPORT_HUGO_SECTION:
:END:

** Emacs
