public/posts/wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wiki</title>
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>jpachecoxyz</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
	<a href="/rss.xml">
	  <i class="fas">&#xf09e;</i>
	</a>
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Wiki</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga0b6214">Emacs</a>
<ul>
<li><a href="#orgdcfed86">Doom Insert item.</a></li>
<li><a href="#orgb5279a0">Highlight yanked text</a></li>
<li><a href="#org25d7518">Replace '-' with '•'.</a></li>
<li><a href="#org9390aa1">Custom<sub>id</sub>.</a></li>
<li><a href="#org0133f0d">Add ID's to headers - Org roam.</a></li>
<li><a href="#org192e374">Toggle org-emphasis-markers</a></li>
<li><a href="#org929128d">Insert Org's files to Outlook.</a>
<ul>
<li><a href="#org09e6f3c">Export file to clipboard.</a></li>
<li><a href="#org0485afc">Add some CSS to the file.</a></li>
</ul>
</li>
<li><a href="#org12d411a">Org TODO auto update.</a></li>
<li><a href="#orge35ef32">Org-buffer-scratchpad.</a></li>
<li><a href="#orge64097d">Toggle buffers.</a></li>
<li><a href="#org12b75e7">Doc at point.</a></li>
<li><a href="#org930151c">Duplicate &amp; move up/down lines.</a></li>
<li><a href="#org109064d">Hide passwords in org files.</a></li>
<li><a href="#org30fe619">Help at point.</a></li>
<li><a href="#orgb1847d8">fz-themes</a></li>
<li><a href="#orga956904">Custom functions.</a></li>
</ul>
</li>
<li><a href="#org3dc727c">Linux</a></li>
<li><a href="#org2faefba">Python</a>
<ul>
<li><a href="#org23b612f">Avoid SSL verification when installing packages through pip.</a></li>
</ul>
</li>
<li><a href="#orgd84faeb">Robots</a></li>
<li><a href="#orge330fc4">Windows</a>
<ul>
<li><a href="#org159dc3e">Change IP address within terminal.</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>

</p>
<div class="PREVIEW" id="org8e6eaa9">
<p>
This is my wiki about some tips and important notes.
</p>

</div>

<div id="outline-container-orga0b6214" class="outline-2">
<h2 id="orga0b6214">Emacs</h2>
<div class="outline-text-2" id="text-orga0b6214">
</div>
<div id="outline-container-orgdcfed86" class="outline-3">
<h3 id="orgdcfed86">Doom Insert item.</h3>
<div class="outline-text-3" id="text-orgdcfed86">
<p>
This script wast taken from <i>doomemacs</i>, it basically insert a item such a heading, subheading, checkbox, etc. based on the item above.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">javier_pacheco utilities.el --- Some useful utilities  -*- lexical-binding: t; -*-</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">+org--insert-item</span> (direction)
  (<span class="org-keyword">let</span> ((context (org-element-lineage
                  (org-element-context)
                  '(table table-row headline inlinetask item plain-list)
                  t)))
    (<span class="org-keyword">pcase</span> (org-element-type context)
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Add a new list item (carrying over checkboxes if necessary)</span>
      ((<span class="org-keyword">or</span> `item `plain-list)
       (<span class="org-keyword">let</span> ((orig-point (point)))
         <span class="org-comment-delimiter">;; </span><span class="org-comment">Position determines where org-insert-todo-heading and `</span><span class="org-comment"><span class="org-constant">org-insert-item</span></span><span class="org-comment">'</span>
         <span class="org-comment-delimiter">;; </span><span class="org-comment">insert the new list item.</span>
         (<span class="org-keyword">if</span> (eq direction 'above)
             (org-beginning-of-item)
           (end-of-line))
         (<span class="org-keyword">let*</span> ((ctx-item? (eq 'item (org-element-type context)))
                (ctx-cb (org-element-property <span class="org-builtin">:contents-begin</span> context))
                <span class="org-comment-delimiter">;; </span><span class="org-comment">Hack to handle edge case where the point is at the</span>
                <span class="org-comment-delimiter">;; </span><span class="org-comment">beginning of the first item</span>
                (beginning-of-list? (<span class="org-keyword">and</span> (not ctx-item?)
                                         (= ctx-cb orig-point)))
                (item-context (<span class="org-keyword">if</span> beginning-of-list?
                                  (org-element-context)
                                context))
                <span class="org-comment-delimiter">;; </span><span class="org-comment">Horrible hack to handle edge case where the</span>
                <span class="org-comment-delimiter">;; </span><span class="org-comment">line of the bullet is empty</span>
                (ictx-cb (org-element-property <span class="org-builtin">:contents-begin</span> item-context))
                (empty? (<span class="org-keyword">and</span> (eq direction 'below)
                             <span class="org-comment-delimiter">;; </span><span class="org-comment">in case contents-begin is nil, or contents-begin</span>
                             <span class="org-comment-delimiter">;; </span><span class="org-comment">equals the position end of the line, the item is</span>
                             <span class="org-comment-delimiter">;; </span><span class="org-comment">empty</span>
                             (<span class="org-keyword">or</span> (not ictx-cb)
                                 (= ictx-cb
                                    (1+ (point))))))
                (pre-insert-point (point)))
           <span class="org-comment-delimiter">;; </span><span class="org-comment">Insert dummy content, so that `</span><span class="org-comment"><span class="org-constant">org-insert-item</span></span><span class="org-comment">'</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">inserts content below this item</span>
           (<span class="org-keyword">when</span> empty?
             (insert <span class="org-string">" "</span>))
           (org-insert-item (org-element-property <span class="org-builtin">:checkbox</span> context))
           <span class="org-comment-delimiter">;; </span><span class="org-comment">Remove dummy content</span>
           (<span class="org-keyword">when</span> empty?
             (delete-region pre-insert-point (1+ pre-insert-point))))))
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Add a new table row</span>
      ((<span class="org-keyword">or</span> `table `table-row)
       (<span class="org-keyword">pcase</span> direction
         ('below (<span class="org-keyword">save-excursion</span> (org-table-insert-row t))
                 (org-table-next-row))
         ('above (<span class="org-keyword">save-excursion</span> (org-shiftmetadown))
                 (+org/table-previous-row))))

      <span class="org-comment-delimiter">;; </span><span class="org-comment">Otherwise, add a new heading, carrying over any todo state, if</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">necessary.</span>
      (_
       (<span class="org-keyword">let</span> ((level (<span class="org-keyword">or</span> (org-current-level) 1)))
         <span class="org-comment-delimiter">;; </span><span class="org-comment">I intentionally avoid `</span><span class="org-comment"><span class="org-constant">org-insert-heading</span></span><span class="org-comment">' and the like because they</span>
         <span class="org-comment-delimiter">;; </span><span class="org-comment">impose unpredictable whitespace rules depending on the cursor</span>
         <span class="org-comment-delimiter">;; </span><span class="org-comment">position. It's simpler to express this command's responsibility at a</span>
         <span class="org-comment-delimiter">;; </span><span class="org-comment">lower level than work around all the quirks in org's API.</span>
         (<span class="org-keyword">pcase</span> direction
           (`below
            (<span class="org-keyword">let</span> (org-insert-heading-respect-content)
              (goto-char (line-end-position))
              (org-end-of-subtree)
              (insert <span class="org-string">"\n"</span> (make-string level ?*) <span class="org-string">" "</span>)))
           (`above
            (org-back-to-heading)
            (insert (make-string level ?*) <span class="org-string">" "</span>)
            (<span class="org-keyword">save-excursion</span> (insert <span class="org-string">"\n"</span>))))
         (run-hooks 'org-insert-heading-hook)
         (<span class="org-keyword">when-let*</span> ((todo-keyword (org-element-property <span class="org-builtin">:todo-keyword</span> context))
                     (todo-type    (org-element-property <span class="org-builtin">:todo-type</span> context)))
           (org-todo
            (<span class="org-keyword">cond</span> ((eq todo-type 'done)
                   <span class="org-comment-delimiter">;; </span><span class="org-comment">Doesn't make sense to create more "DONE" headings</span>
                   (car (+org-get-todo-keywords-for todo-keyword)))
                  (todo-keyword)
                  ('todo)))))))

    (<span class="org-keyword">when</span> (org-invisible-p)
      (org-show-hidden-entry))
    (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (<span class="org-keyword">bound-and-true-p</span> evil-local-mode)
               (not (evil-emacs-state-p)))
      (evil-insert 1))))

<span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
(<span class="org-keyword">defun</span> <span class="org-function-name">+org/insert-item-below</span> (count)
  <span class="org-doc">"Inserts a new heading, table cell or item below the current one."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"p"</span>)
  (<span class="org-keyword">dotimes</span> (_ count) (+org--insert-item 'below)))

<span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
(<span class="org-keyword">defun</span> <span class="org-function-name">+org/insert-item-above</span> (count)
  <span class="org-doc">"Inserts a new heading, table cell or item above the current one."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"p"</span>)
  (<span class="org-keyword">dotimes</span> (_ count) (+org--insert-item 'above)))


(<span class="org-keyword">defun</span> <span class="org-function-name">org-make-olist</span> (arg)
  (<span class="org-keyword">interactive</span> <span class="org-string">"P"</span>)
  (<span class="org-keyword">let</span> ((n (<span class="org-keyword">or</span> arg 1)))
    (<span class="org-keyword">when</span> (region-active-p)
      (<span class="org-keyword">setq</span> n (count-lines (region-beginning)
                           (region-end)))
      (goto-char (region-beginning)))
    (<span class="org-keyword">dotimes</span> (i n)
      (beginning-of-line)
      (insert (concat (number-to-string (1+ i)) <span class="org-string">". "</span>))
      (forward-line))))
</pre>
</div>
</div>
</div>
