public/posts/wiki.html

<div id="outline-container-orgb5279a0" class="outline-3">
<h3 id="orgb5279a0">Highlight yanked text</h3>
<div class="outline-text-3" id="text-orgb5279a0">
<p>
This function describes itself so&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">meain/evil-yank-advice</span> (orig-fn beg end <span class="org-type">&amp;rest</span> args)
  (pulse-momentary-highlight-region beg end 'mode-line-active)
  (apply orig-fn beg end args))
(advice-add 'evil-yank <span class="org-builtin">:around</span> 'meain/evil-yank-advice)
</pre>
</div>
</div>
</div>

<div id="outline-container-org25d7518" class="outline-3">
<h3 id="org25d7518">Replace '-' with '•'.</h3>
<div class="outline-text-3" id="text-org25d7518">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">jp/org-font-setup</span> ()
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Replace list hyphen with dot</span>
  (font-lock-add-keywords 'org-mode
                          '((<span class="org-string">"^ *</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[-]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string"> "</span>
                             (0 (<span class="org-keyword">prog1</span> () (compose-region (match-beginning 1) (match-end 1) <span class="org-string">"&#8226;"</span>)))))))

(jp/org-font-setup)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9390aa1" class="outline-3">
<h3 id="org9390aa1">Custom<sub>id</sub>.</h3>
<div class="outline-text-3" id="text-org9390aa1">
<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;;;; </span><span class="org-comment">org-id</span>
(<span class="org-keyword">declare-function</span> org-id-add-location <span class="org-string">"org"</span>)
(<span class="org-keyword">declare-function</span> org-with-point-at <span class="org-string">"org"</span>)
(<span class="org-keyword">declare-function</span> org-entry-get <span class="org-string">"org"</span>)
(<span class="org-keyword">declare-function</span> org-id-new <span class="org-string">"org"</span>)
(<span class="org-keyword">declare-function</span> org-entry-put <span class="org-string">"org"</span>)
 
<span class="org-comment-delimiter">;; </span><span class="org-comment">Copied from this article (with minor tweaks from my side):</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">https://writequit.org/articles/emacs-org-mode-generate-ids.html.</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">jp/org--id-get</span> (<span class="org-type">&amp;optional</span> pom create prefix)
  <span class="org-doc">"Get the CUSTOM_ID property of the entry at point-or-marker POM.</span>
<span class="org-doc">If POM is nil, refer to the entry at point.  If the entry does</span>
<span class="org-doc">not have an CUSTOM_ID, the function returns nil.  However, when</span>
<span class="org-doc">CREATE is non nil, create a CUSTOM_ID if none is present already.</span>
<span class="org-doc">PREFIX will be passed through to `</span><span class="org-doc"><span class="org-constant">org-id-new</span></span><span class="org-doc">'.  In any case, the</span>
<span class="org-doc">CUSTOM_ID of the entry is returned."</span>
  (<span class="org-keyword">org-with-point-at</span> pom
    (<span class="org-keyword">let</span> ((id (org-entry-get nil <span class="org-string">"CUSTOM_ID"</span>)))
      (<span class="org-keyword">cond</span>
       ((<span class="org-keyword">and</span> id (stringp id) (string-match \\S- id))
        id)
       (create
        (<span class="org-keyword">setq</span> id (org-id-new (concat prefix <span class="org-string">"h"</span>)))
        (org-entry-put pom <span class="org-string">"CUSTOM_ID"</span> id)
        (org-id-add-location id (format <span class="org-string">"%s"</span> (buffer-file-name (buffer-base-buffer))))
        id)))))
 
(<span class="org-keyword">declare-function</span> org-map-entries <span class="org-string">"org"</span>)
 
<span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
(<span class="org-keyword">defun</span> <span class="org-function-name">jp/org-id-headlines</span> ()
  <span class="org-doc">"Add missing CUSTOM_ID to all headlines in current file."</span>
  (<span class="org-keyword">interactive</span>)
  (org-map-entries
   (<span class="org-keyword">lambda</span> () (jp/org--id-get (point) t))))

<span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
(<span class="org-keyword">defun</span> <span class="org-function-name">jp/org-id-headline</span> ()
  <span class="org-doc">"Add missing CUSTOM_ID to headline at point."</span>
  (<span class="org-keyword">interactive</span>)
  (jp/org--id-get (point) t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0133f0d" class="outline-3">
<h3 id="org0133f0d">Add ID's to headers - Org roam.</h3>
<div class="outline-text-3" id="text-org0133f0d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">jp/org-id-store-link-for-headers</span> ()
  <span class="org-doc">"Run `</span><span class="org-doc"><span class="org-constant">org-id-store-link</span></span><span class="org-doc">' for each header in the current buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">save-excursion</span>
    (goto-char (point-min))
    (<span class="org-keyword">while</span> (re-search-forward org-heading-regexp nil t)
      (org-id-store-link))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org192e374" class="outline-3">
<h3 id="org192e374">Toggle org-emphasis-markers</h3>
<div class="outline-text-3" id="text-org192e374">
<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">defun</span> <span class="org-function-name">jp/org-toggle-emphasis-markers</span> (<span class="org-type">&amp;optional</span> arg)
  <span class="org-doc">"Toggle emphasis markers and display a message."</span>
  (<span class="org-keyword">interactive</span> <span class="org-string">"p"</span>)
  (<span class="org-keyword">let</span> ((markers org-hide-emphasis-markers)
        (msg <span class="org-string">""</span>))
    (<span class="org-keyword">when</span> markers
      (<span class="org-keyword">setq-local</span> org-hide-emphasis-markers nil)
      (<span class="org-keyword">setq</span> msg <span class="org-string">"Emphasis markers are now visible."</span>))
    (<span class="org-keyword">unless</span> markers
      (<span class="org-keyword">setq-local</span> org-hide-emphasis-markers t)
      (<span class="org-keyword">setq</span> msg <span class="org-string">"Emphasis markers are now hidden."</span>))
    (message <span class="org-string">"%s"</span> msg)
    (<span class="org-keyword">when</span> arg
      (font-lock-fontify-buffer))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org929128d" class="outline-3">
<h3 id="org929128d">Insert Org's files to Outlook.</h3>
<div class="outline-text-3" id="text-org929128d">
</div>
<div id="outline-container-org09e6f3c" class="outline-4">
<h4 id="org09e6f3c">Export file to clipboard.</h4>
<div class="outline-text-4" id="text-org09e6f3c">
<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">defun</span> <span class="org-function-name">export-org-email</span> ()
  <span class="org-doc">"Export the current email org buffer and copy it to the</span>
<span class="org-doc">clipboard"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((org-export-show-temporary-export-buffer nil)
        (org-html-head (org-email-html-head)))
    (org-html-export-as-html)
    (<span class="org-keyword">with-current-buffer</span> <span class="org-string">"*Org HTML Export*"</span>
      (kill-new (buffer-string)))
    (message <span class="org-string">"HTML copied to clipboard"</span>)))
(global-set-key (kbd <span class="org-string">"C-c C-x C-e"</span>) 'export-org-email)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0485afc" class="outline-4">
<h4 id="org0485afc">Add some CSS to the file.</h4>
<div class="outline-text-4" id="text-org0485afc">
<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">defun</span> <span class="org-function-name">org-email-html-head</span> ()
  <span class="org-doc">"Create the header with CSS for use with email"</span>
  (concat
   <span class="org-string">"&lt;style type=\"text/css\"&gt;\n"</span>
   <span class="org-string">"&lt;!--/*--&gt;&lt;![CDATA[/*&gt;&lt;!--*/\n"</span>
   (<span class="org-keyword">with-temp-buffer</span>
     (insert-file-contents
      <span class="org-string">"~/.emacs.d/src/css/org2outlook.css"</span>)
     (buffer-string))
   <span class="org-string">"/*]]&gt;*/--&gt;\n"</span>
   <span class="org-string">"&lt;/style&gt;\n"</span>))
</pre>
</div>
</div>
</div>
</div>
