public/posts/wiki.html
<div id="outline-container-org12d411a" class="outline-3">
<h3 id="org12d411a">Org TODO auto update.</h3>
<div class="outline-text-3" id="text-org12d411a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">org-todo-if-needed</span> (state)
  <span class="org-doc">"Change header state to STATE unless the current item is in STATE already."</span>
  (<span class="org-keyword">unless</span> (string-equal (org-get-todo-state) state)
    (org-todo state)))

(<span class="org-keyword">defun</span> <span class="org-function-name">ct/org-summary-todo-cookie</span> (n-done n-not-done)
  <span class="org-doc">"Switch header state to DONE when all subentries are DONE, to TODO when none are DONE, and to DOING otherwise"</span>
  (<span class="org-keyword">let</span> (org-log-done org-log-states)   <span class="org-comment-delimiter">; </span><span class="org-comment">turn off logging</span>
    (org-todo-if-needed (<span class="org-keyword">cond</span> ((= n-done 0)
                               <span class="org-string">"TODO"</span>)
                              ((= n-not-done 0)
                               <span class="org-string">"DONE"</span>)
                              (t
                               <span class="org-string">"DOING"</span>)))))
(add-hook 'org-after-todo-statistics-hook #'ct/org-summary-todo-cookie)

(<span class="org-keyword">defun</span> <span class="org-function-name">ct/org-summary-checkbox-cookie</span> ()
  <span class="org-doc">"Switch header state to DONE when all checkboxes are ticked, to TODO when none are ticked, and to DOING otherwise"</span>
  (<span class="org-keyword">let</span> (beg end)
    (<span class="org-keyword">unless</span> (not (org-get-todo-state))
      (<span class="org-keyword">save-excursion</span>
        (org-back-to-heading t)
        (<span class="org-keyword">setq</span> beg (point))
        (end-of-line)
        (<span class="org-keyword">setq</span> end (point))
        (goto-char beg)
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Regex group 1: %-based cookie</span>
        <span class="org-comment-delimiter">;; </span><span class="org-comment">Regex group 2 and 3: x/y cookie</span>
        (<span class="org-keyword">if</span> (re-search-forward <span class="org-string">"\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[0-9]*%</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">\\[</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[0-9]*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">/</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[0-9]*</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\\]"</span>
                               end t)
            (<span class="org-keyword">if</span> (match-end 1)
                <span class="org-comment-delimiter">;; </span><span class="org-comment">[xx%] cookie support</span>
                (<span class="org-keyword">cond</span> ((equal (match-string 1) <span class="org-string">"100%"</span>)
                       (org-todo-if-needed <span class="org-string">"DONE"</span>))
                      ((equal (match-string 1) <span class="org-string">"0%"</span>)
                       (org-todo-if-needed <span class="org-string">"TODO"</span>))
                      (t
                       (org-todo-if-needed <span class="org-string">"DOING"</span>)))
              <span class="org-comment-delimiter">;; </span><span class="org-comment">[x/y] cookie support</span>
              (<span class="org-keyword">if</span> (&gt; (match-end 2) (match-beginning 2)) <span class="org-comment-delimiter">; </span><span class="org-comment">= if not empty</span>
                  (<span class="org-keyword">cond</span> ((equal (match-string 2) (match-string 3))
                         (org-todo-if-needed <span class="org-string">"DONE"</span>))
                        ((<span class="org-keyword">or</span> (equal (string-trim (match-string 2)) <span class="org-string">""</span>)
                             (equal (match-string 2) <span class="org-string">"0"</span>))
                         (org-todo-if-needed <span class="org-string">"TODO"</span>))
                        (t
                         (org-todo-if-needed <span class="org-string">"DOING"</span>)))
                (org-todo-if-needed <span class="org-string">"DOING"</span>))))))))
(add-hook 'org-checkbox-statistics-hook #'ct/org-summary-checkbox-cookie)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge35ef32" class="outline-3">
<h3 id="orge35ef32">Org-buffer-scratchpad.</h3>
<div class="outline-text-3" id="text-orge35ef32">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">new-scratch-pad</span> ()
  <span class="org-doc">"Create a new org-mode buffer for random stuff."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">progn</span>
        (<span class="org-keyword">let</span> ((buffer (generate-new-buffer <span class="org-string">"Org-scratch-buffer"</span>)))
      (switch-to-buffer buffer)
      (<span class="org-keyword">setq</span> buffer-offer-save t)
      (org-mode)
      (olivetti-mode t))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge64097d" class="outline-3">
<h3 id="orge64097d">Toggle buffers.</h3>
<div class="outline-text-3" id="text-orge64097d">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Toggle *scratch* buffer.</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">toggle-scratch-buffer</span> ()
  <span class="org-doc">"Toggle the *scratch* buffer"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (string= (buffer-name) <span class="org-string">"*scratch*"</span>)
          (bury-buffer)
        (switch-to-buffer (get-buffer-create <span class="org-string">"*scratch*"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">toggle-org-buffer</span> ()
  <span class="org-doc">"Toggle the Org-scratch-buffer buffer"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (equal (buffer-name (current-buffer)) <span class="org-string">"Org-scratch-buffer"</span>)
          (<span class="org-keyword">if</span> (one-window-p t)
                  (switch-to-buffer (other-buffer))
        (delete-window))
    (<span class="org-keyword">if</span> (get-buffer <span class="org-string">"Org-scratch-buffer"</span>)
        (<span class="org-keyword">if</span> (get-buffer-window <span class="org-string">"Org-scratch-buffer"</span>)
            (<span class="org-keyword">progn</span>
                          (bury-buffer <span class="org-string">"Org-scratch-buffer"</span>)
                          (delete-window (get-buffer-window <span class="org-string">"Org-scratch-buffer"</span>)))
                  (switch-to-buffer <span class="org-string">"Org-scratch-buffer"</span>))
          (new-scratch-pad))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Toggle *eshell* buffer.</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">toggle-eshell-buffer</span> ()
  <span class="org-doc">"Toggle the *eshell* buffer"</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (string= (buffer-name) <span class="org-string">"*eshell*"</span>)
          (bury-buffer)
        (switch-to-buffer (get-buffer-create <span class="org-string">"*eshell*"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org12b75e7" class="outline-3">
<h3 id="org12b75e7">Doc at point.</h3>
<div class="outline-text-3" id="text-org12b75e7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my-show-doc-or-describe-symbol</span> ()
  <span class="org-doc">"Show LSP UI doc if LSP is active, otherwise describe symbol at point."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">if</span> (<span class="org-keyword">bound-and-true-p</span> lsp-mode)
      (lsp-ui-doc-glance)
    (describe-symbol-at-point)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org930151c" class="outline-3">
<h3 id="org930151c">Duplicate &amp; move up/down lines.</h3>
<div class="outline-text-3" id="text-org930151c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">duplicate-line</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((line-text (thing-at-point 'line t)))
    (<span class="org-keyword">save-excursion</span>
      (move-end-of-line 1)
      (newline)
      (insert line-text)))
  (forward-line 1))

(<span class="org-keyword">defun</span> <span class="org-function-name">move-line-up</span> ()
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">when</span> (not (= (line-number-at-pos) 1))
    (transpose-lines 1)
    (forward-line -2)))

(<span class="org-keyword">defun</span> <span class="org-function-name">move-line-down</span> ()
  (<span class="org-keyword">interactive</span>)
  (forward-line 1)
  (<span class="org-keyword">when</span> (not (= (line-number-at-pos) (point-max)))
    (transpose-lines 1))
  (forward-line -1))
</pre>
</div>
</div>
</div>
