public/posts/wiki.html
<div id="outline-container-org109064d" class="outline-3">
<h3 id="org109064d">Hide passwords in org files.</h3>
<div class="outline-text-3" id="text-org109064d">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Define a custom face for the highlight</span>
(<span class="org-keyword">defface</span> <span class="org-variable-name">my-highlight-face</span>
  '((t (<span class="org-builtin">:foreground</span> <span class="org-string">"gray"</span>))) <span class="org-comment-delimiter">; </span><span class="org-comment">Change "red" to your desired color</span>
  <span class="org-doc">"Face for highlighting !!word!! patterns."</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Function to replace matched text with asterisks</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">replace-with-asterisks</span> (limit)
  <span class="org-doc">"Replace !!word!! with asterisks up to LIMIT."</span>
  (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"!!</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.*?</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">!!"</span> limit t)
    (<span class="org-keyword">let*</span> ((match (match-string 1))
           (start (match-beginning 0))
           (end (match-end 0))
           (asterisks (make-string (length match) ?*)))
      (add-text-properties start end `(display ,asterisks face my-highlight-face)))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Add custom keyword for font-lock in org-mode</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-mode-custom-font-lock</span> ()
  <span class="org-doc">"Add custom font-lock keywords for org-mode."</span>
  (font-lock-add-keywords nil
                          '((replace-with-asterisks))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Hook the custom font-lock configuration into org-mode</span>
(add-hook 'org-mode-hook 'my/org-mode-custom-font-lock)
</pre>
</div>
</div>
</div>
<div id="outline-container-org30fe619" class="outline-3">
<h3 id="org30fe619">Help at point.</h3>
<div class="outline-text-3" id="text-org30fe619">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">describe-symbol-at-point</span> ()
  <span class="org-doc">"Display the documentation of the symbol at point, if it exists."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((symbol (symbol-at-point)))
    (<span class="org-keyword">if</span> symbol
        (<span class="org-keyword">cond</span>
         ((fboundp symbol) (describe-function symbol))
         ((boundp symbol) (describe-variable symbol))
         (t (message <span class="org-string">"No documentation found for symbol at point: %s"</span> symbol)))
      (message <span class="org-string">"No symbol at point"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1847d8" class="outline-3">
<h3 id="orgb1847d8">fz-themes</h3>
<div class="outline-text-3" id="text-orgb1847d8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">custom-jp-themes</span> (<span class="org-type">&amp;optional</span> theme-dir)

  (<span class="org-keyword">defun</span> <span class="org-function-name">custom-jp-themes</span> (<span class="org-type">&amp;optional</span> theme-dir)
        <span class="org-doc">"Return a list of custom themes from a specified directory.</span>
<span class="org-doc">Search the directory for files named FOO-theme.el, and return a list of FOO symbols,</span>
<span class="org-doc">excluding the '</span><span class="org-doc"><span class="org-constant">default</span></span><span class="org-doc">' theme and any internal themes.</span>

<span class="org-doc">If THEME-DIR is nil, it defaults to `</span><span class="org-doc"><span class="org-constant">~/.emacs.d/lisp/jp-themes/</span></span><span class="org-doc">'."</span>
        (<span class="org-keyword">let</span> ((suffix <span class="org-string">"-theme\\.el\\'"</span>)
          (directory (<span class="org-keyword">or</span> theme-dir <span class="org-string">"~/.emacs.d/lisp/jp-themes/"</span>))
          themes)
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Ensure the directory exists</span>
      (<span class="org-keyword">when</span> (file-directory-p directory)
                <span class="org-comment-delimiter">;; </span><span class="org-comment">Iterate over all theme files in the directory</span>
                (<span class="org-keyword">dolist</span> (file (directory-files directory nil suffix))
          (<span class="org-keyword">let</span> ((theme (intern (substring file 0 (string-match-p suffix file)))))
                        <span class="org-comment-delimiter">;; </span><span class="org-comment">Add to the list if it's valid, and exclude Emacs built-in "default" theme</span>
                        (<span class="org-keyword">and</span> (not (eq theme 'default))  <span class="org-comment-delimiter">;; </span><span class="org-comment">Ensure "default" is excluded</span>
               (not (memq theme themes))  <span class="org-comment-delimiter">;; </span><span class="org-comment">Avoid duplicates</span>
               (<span class="org-keyword">push</span> theme themes)))))
      (nreverse themes)))

  (<span class="org-keyword">defcustom</span> <span class="org-variable-name">fz-themes</span> nil
        <span class="org-doc">"List of themes (symbols or regexps) to be presented for selection.</span>
<span class="org-doc">nil shows all `</span><span class="org-doc"><span class="org-constant">custom-available-themes</span></span><span class="org-doc">'."</span>
        <span class="org-builtin">:type</span> '(repeat (choice symbol regexp)))

  (<span class="org-keyword">defun</span> <span class="org-function-name">fz-theme</span> (theme)
        <span class="org-doc">"Disable current themes and enable THEME from `fz-themes`.</span>

<span class="org-doc">The command supports previewing the currently selected theme."</span>
        (<span class="org-keyword">interactive</span>
         (list
      (<span class="org-keyword">let*</span> ((regexp (consult--regexp-filter
                      (mapcar (<span class="org-keyword">lambda</span> (x) (<span class="org-keyword">if</span> (stringp x) x (format <span class="org-string">"\\`</span><span class="org-string"><span class="org-constant"><span class="org-constant">%s\\</span></span></span><span class="org-string">'"</span> x)))
                              fz-themes)))
                         (avail-themes (seq-filter
                                                        (<span class="org-keyword">lambda</span> (x) (string-match-p regexp (symbol-name x)))
                                                        (custom-jp-themes)))  <span class="org-comment-delimiter">;; </span><span class="org-comment">Only use themes from custom-jp-themes</span>
                         (saved-theme (car custom-enabled-themes)))
                (consult--read
                 (mapcar #'symbol-name avail-themes)
                 <span class="org-builtin">:prompt</span> <span class="org-string">"Theme: "</span>
                 <span class="org-builtin">:require-match</span> t
                 <span class="org-builtin">:category</span> 'theme
                 <span class="org-builtin">:history</span> 'consult--theme-history
                 <span class="org-builtin">:lookup</span> (<span class="org-keyword">lambda</span> (selected <span class="org-type">&amp;rest</span> _)
                   (<span class="org-keyword">setq</span> selected (<span class="org-keyword">and</span> selected (intern-soft selected)))
                   (<span class="org-keyword">or</span> (<span class="org-keyword">and</span> selected (car (memq selected avail-themes)))
                      saved-theme))
                 <span class="org-builtin">:state</span> (<span class="org-keyword">lambda</span> (action theme)
                  (<span class="org-keyword">pcase</span> action
                                        ('return (fz-theme (<span class="org-keyword">or</span> theme saved-theme)))
                                        ((<span class="org-keyword">and</span> 'preview (guard theme)) (fz-theme theme))))
                 <span class="org-builtin">:default</span> (symbol-name (<span class="org-keyword">or</span> saved-theme 'default))))))
        (<span class="org-keyword">when</span> (eq theme 'default) (<span class="org-keyword">setq</span> theme nil))
        (<span class="org-keyword">unless</span> (eq theme (car custom-enabled-themes))
      (mapc #'disable-theme custom-enabled-themes)
      (<span class="org-keyword">when</span> theme
                (<span class="org-keyword">if</span> (custom-theme-p theme)
                        (enable-theme theme)
          (load-theme theme <span class="org-builtin">:no-confirm</span>)))))
</pre>
</div>
</div>
</div>
