public/posts/wiki.html
<div id="outline-container-orga956904" class="outline-3">
<h3 id="orga956904">Custom functions.</h3>
<div class="outline-text-3" id="text-orga956904">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Open files in the lisp folder</span>
(<span class="org-keyword">require</span> '<span class="org-constant">find-lisp</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">open-lisp-and-org-files</span> ()
  <span class="org-doc">"Open a Lisp or Org file from ~/.emacs.d/lisp directory, including subfolders."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((directory <span class="org-string">"~/.emacs.d/lisp"</span>)
         (el-files (find-lisp-find-files directory <span class="org-string">".*\\.el$"</span>))
         (org-files (find-lisp-find-files directory <span class="org-string">".*\\.org$"</span>))
         (all-files (append el-files org-files))
         (file (completing-read <span class="org-string">"Select file: "</span> all-files nil t)))
    (find-file file)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Follow urls in the buffer</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">list-and-open-url-in-buffer</span> ()
  <span class="org-doc">"List all URLs in the current buffer, display them in the minibuffer, and open a selected URL in the browser."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> (urls)
    (<span class="org-keyword">save-excursion</span>
      (goto-char (point-min))
      (<span class="org-keyword">while</span> (re-search-forward <span class="org-string">"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">http</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">https</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">ftp</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">file</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">mailto</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">:[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string"> \t\n]+"</span> nil t)
        (<span class="org-keyword">push</span> (match-string 0) urls)))
    (<span class="org-keyword">if</span> urls
        (<span class="org-keyword">let</span> ((url (completing-read <span class="org-string">"Select URL to open: "</span> (reverse urls) nil t)))
          (browse-url url))
      (message <span class="org-string">"No URLs found in the buffer."</span>))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Export org files to pdf using tectonic</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">org-export-to-latex-and-compile-with-tectonic</span> ()
  <span class="org-doc">"Export the current Org file to LaTeX, then compile with tectonic using shell-escape."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let*</span> ((org-file (buffer-file-name))
         (tex-file (concat (file-name-sans-extension org-file) <span class="org-string">".tex"</span>))
         (tectonic-command (concat <span class="org-string">"tectonic -Z shell-escape "</span> tex-file)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Export Org file to LaTeX</span>
    (org-latex-export-to-latex)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Run tectonic command in a temporary buffer to avoid displaying the output</span>
    (<span class="org-keyword">with-temp-buffer</span>
      (shell-command tectonic-command (current-buffer)))
    (message <span class="org-string">"Compiled %s to PDF with Tectonic."</span> tex-file)))

(global-set-key (kbd <span class="org-string">"C-c e l"</span>) 'org-export-to-latex-and-compile-with-tectonic)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Update my web-page</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">publish-my-blog</span> ()
  <span class="org-doc">"Export all subtrees with Hugo, then run the publish blog script within Emacs and display a success message in the minibuffer."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((commit-msg (read-string <span class="org-string">"Enter commit message: "</span>)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Export all subtrees with Hugo</span>
    (org-hugo-export-wim-to-md <span class="org-builtin">:all-subtrees</span>)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Run the publish script</span>
    (<span class="org-keyword">let</span> ((process (start-process-shell-command
                    <span class="org-string">"publish-blog"</span>                       <span class="org-comment-delimiter">; </span><span class="org-comment">Process name</span>
                    <span class="org-string">"*publish-blog-output*"</span>              <span class="org-comment-delimiter">; </span><span class="org-comment">Output buffer</span>
                    (format <span class="org-string">"~/webdev/jpachecoxyz.github.io/hugo/publish.sh \"%s\""</span> commit-msg))))  <span class="org-comment-delimiter">; </span><span class="org-comment">Run the script with the commit message</span>
      <span class="org-comment-delimiter">;; </span><span class="org-comment">Set up the process sentinel to check the process status</span>
      (set-process-sentinel
       process
       (<span class="org-keyword">lambda</span> (process event)
         (<span class="org-keyword">when</span> (string= event <span class="org-string">"finished\n"</span>)
           (message <span class="org-string">"jpacheco.xyz was correctly updated!"</span>)))))))

(global-set-key (kbd <span class="org-string">"C-c u b"</span>) 'publish-my-blog)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Search roam</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">jp/search-roam</span> ()
  <span class="org-doc">"Run consult-ripgrep on the org roam directory"</span>
  (<span class="org-keyword">interactive</span>)
  (consult-ripgrep org-roam-directory nil))
(global-set-key (kbd <span class="org-string">"C-c n s"</span>) 'jp/search-roam)

(<span class="org-keyword">defun</span> <span class="org-function-name">jp/yt-shorts-timer</span> ()
  (<span class="org-keyword">interactive</span>)
  (org-timer-set-timer <span class="org-string">"55s"</span>))
(global-set-key (kbd <span class="org-string">"&lt;f4&gt;"</span>) 'jp/yt-shorts-timer)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3dc727c" class="outline-2">
<h2 id="org3dc727c">Linux</h2>
</div>
<div id="outline-container-org2faefba" class="outline-2">
<h2 id="org2faefba">Python</h2>
<div class="outline-text-2" id="text-org2faefba">
</div>
<div id="outline-container-org23b612f" class="outline-3">
<h3 id="org23b612f">Avoid SSL verification when installing packages through pip.</h3>
<div class="outline-text-3" id="text-org23b612f">
<p>
I have some issues with the firewall in one of my jobs, so in order to be able to install python packages through pip we need to skip the <code>SSL</code> verification with the following flags.
</p>
<div class="org-src-container">
<pre class="src src-shell">pip install --no-cache-dir --trusted-host pypi.org --trusted-host pypi.python.org --trusted-host files.pythonhosted.org &lt;program&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd84faeb" class="outline-2">
<h2 id="orgd84faeb">Robots</h2>
</div>
<div id="outline-container-orge330fc4" class="outline-2">
<h2 id="orge330fc4">Windows</h2>
<div class="outline-text-2" id="text-orge330fc4">
</div>
<div id="outline-container-org159dc3e" class="outline-3">
<h3 id="org159dc3e">Change IP address within terminal.</h3>
<div class="outline-text-3" id="text-org159dc3e">
<p>
This cmd script prompt for an IP to b changed in the computer. Must run as root/administrator.
</p>
<div class="org-src-container">
<pre class="src src-bat">@<span class="org-builtin">echo</span> off
<span class="org-builtin">setlocal</span>

<span class="org-comment-delimiter">rem </span><span class="org-comment">Prompt the user for new IP address</span>
<span class="org-builtin">set</span> <span class="org-variable-name">/</span><span class="org-type"><span class="org-variable-name">p</span></span> newIP=<span class="org-string">"Enter the new IP address: "</span>
<span class="org-builtin">set</span> <span class="org-string">"newSubnetMask=255.255.255.0"</span>

<span class="org-comment-delimiter">rem </span><span class="org-comment">Set the new IP address while keeping existing subnet mask and gateway</span>
netsh interface ipv4 <span class="org-builtin">set</span> <span class="org-variable-name">address</span> name=<span class="org-string">"Ethernet"</span> static %<span class="org-variable-name">newIP</span>% %<span class="org-variable-name">newSubnetMask</span>% 

<span class="org-comment-delimiter">rem </span><span class="org-comment">Display the new IP configuration</span>

<span class="org-keyword">if</span> %<span class="org-variable-name">errorlevel</span>% <span class="org-keyword">equ</span> 0 (
    <span class="org-builtin">echo</span> IP address changed successfully.
) <span class="org-keyword">else</span> (
    <span class="org-builtin">echo</span> Failed to change IP address. Please make sure you have administrative privileges.
)

<span class="org-builtin">endlocal</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-09-03 Tue 15:40</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
